# Практика использования переменных
a = 3
print(a)
a += 4
print(a)  # 7
print(2 * a)  # 14
print(a, 2 * a)  # 7 14

# Напишем программу, которая спрашивает у пользователя его имя и приветствует его
# name = input()  # Pavel
# print('Hello', name)  # Hello Pavel

# Для того, чтобы было понятно, что от нас просят, удобно в функцию input положить "Enter your name"
# name = input('Enter your name')  # Pavel
# print('Hello', name)  # Hello Pavel

# Напишем программу, получающую число с клавиатуры и выдающую число в два раза больше
# a = int(input()) # читаем строку и преобразуем её в число
# print(a * 2)

# Напишем программу, получающую на вход 2 числа и выдающую нам их произведение
# Пускай пользователь вводит новое число с новой строки
# a = int(input())
# b = int(input())
# print(a * b)
