# Ранее упоминался логический тип данных bool, теперь посмотрим на логические значения чуть более детально
# Имеются два логических значения
#   True - истина (1)
#   False - ложь (0)
# Существуют три основные операции с логическими значениями
#   x or y
#   x and y
#   not x

# Часто логические значения возникают при сравнении чисел
# Мы можем сравнивать числа используя следующие операции сравнения
#   <   строго меньше
#   <=  меньше или равно
#   >   строго больше
#   >=  больше или равно
#   ==  равно
#   !=  не равно

